[
  {
    "heading": "Introduction",
    "description": [
      {
        "headerName": "",
        "termDescription": "Welcome to Giverr! By accessing or using our website, you agree to comply with and be bound by these Terms of Service. Please read them carefully."
      }
    ]
  },
  {
    "heading": "Definitions",
    "description": [
      {
        "headerName": "Giverr",
        "termDescription": "Refers to our platform, services, and website located at [website URL]."
      },
      {
        "headerName": "User",
        "termDescription": "Any individual or entity that accesses or uses Giverr."
      },
      {
        "headerName": "Content",
        "termDescription": "Any information, text, graphics, photos, or other materials uploaded, downloaded, or appearing on Giverr."
      }
    ]
  },
  {
    "heading": "Use of Services",
    "description": [
      {
        "headerName": "Account Registration",
        "termDescription": "You may need to create an account to access certain features. You are responsible for maintaining the confidentiality of your account information."
      },
      {
        "headerName": "User Conduct",
        "termDescription": "You agree not to use Giverr for any unlawful purpose or in a way that might harm, disable, overburden, or impair the platform."
      }
    ]
  },
  {
    "heading": "Event Submissions",
    "description": [
      {
        "headerName": "Submission Process",
        "termDescription": "Users may submit events for consideration. Giverr reserves the right to approve or reject any event submission."
      },
      {
        "headerName": "Accuracy",
        "termDescription": "Users must provide accurate and complete information when submitting events."
      },
      {
        "headerName": "Approval and Rejection",
        "termDescription": "Users will be notified via email whether their event has been accepted or rejected. Giverr is not obligated to provide a reason for rejection."
      }
    ]
  },
  {
    "heading": "Content Ownership and Rights",
    "description": [
      {
        "headerName": "User Content",
        "termDescription": "Users retain ownership of the content they submit but grant Giverr a worldwide, non-exclusive, royalty-free license to use, distribute, modify, and display such content."
      },
      {
        "headerName": "Giverr Content",
        "termDescription": "All materials and content on Giverr, including text, graphics, logos, and software, are the property of Giverr and are protected by intellectual property laws."
      }
    ]
  },
  {
    "heading": "Privacy",
    "description": [
      {
        "headerName": "Data Collection",
        "termDescription": "Giverr collects personal information as described in our Privacy Policy."
      },
      {
        "headerName": "Data Use",
        "termDescription": "By using Giverr, you consent to the collection and use of your information as outlined in the Privacy Policy."
      }
    ]
  },
  {
    "heading": "Limitation of Liability",
    "description": [
      {
        "headerName": "",
        "termDescription": "Giverr will not be liable for any indirect, incidental, special, consequential, or punitive damages resulting from your use of the platform."
      }
    ]
  },
  {
    "heading": "Indemnification",
    "description": [
      {
        "headerName": "",
        "termDescription": "You agree to indemnify and hold harmless Giverr, its affiliates, officers, agents, and employees from any claims, liabilities, damages, losses, and expenses arising from your use of the platform or violation of these Terms."
      }
    ]
  },
  {
    "heading": "Termination",
    "description": [
      {
        "headerName": "",
        "termDescription": "Giverr reserves the right to terminate or suspend your account at any time, without notice, for conduct that we believe violates these Terms or is harmful to other users."
      }
    ]
  },
  {
    "heading": "Governing Law",
    "description": [
      {
        "headerName": "",
        "termDescription": "These Terms are governed by and construed in accordance with the laws of the state / province & country that you reside in without regard to its conflict of law principles."
      }
    ]
  },
  {
    "heading": "Changes to Terms",
    "description": [
      {
        "headerName": "",
        "termDescription": "Giverr may modify these Terms from time to time. We will notify you of any changes by posting the new Terms on the platform. Your continued use of Giverr after such changes constitutes your acceptance of the new Terms."
      }
    ]
  },
  {
    "heading": "Contact Us",
    "description": [
      {
        "headerName": "",
        "termDescription": "If you have any questions about these Terms, please contact us at arvind@giverr.org."
      }
    ]
  }
]
